algorithms/CoupledCluster/CoupledCluster.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-12-17 Fri 20:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CoupledCluster</title>
<meta name="generator" content="Org mode" />

    <meta charset='UTF-8'>
    <meta name='apple-mobile-web-app-capable' content='yes'>
    <meta name='viewport' content='width=device-width, initial-scale=1'>
    <link
      href='https://cdn.jsdelivr.net/npm/bootstrap@5.1.1/dist/css/bootstrap.min.css'
      rel='stylesheet'
      integrity='sha384-F3w7mX95PdgyTmZZMECAngseQB83DfGTowi0iMjiWaeVhAn4FJkqJByhZMI3AhiU'
      crossorigin='anonymous'>
</head>
<body>
<div id="preamble" class="status">

  <nav class='navbar navbar-expand-lg navbar-light bg-light'>
    <div class='container-fluid'>
      <a class='navbar-brand' href='#'>
        Cc4s
      </a>
      <button class='navbar-toggler' type='button'
              data-bs-toggle='collapse'
              data-bs-target='#navbarSupportedContent'
              aria-controls='navbarSupportedContent'
              aria-expanded='false'
              aria-label='Toggle navigation'>
        <span class='navbar-toggler-icon'></span>
      </button>
      <div class='collapse navbar-collapse' id='navbarSupportedContent'>
        <ul class='navbar-nav me-auto mb-2 mb-lg-0'>
          <li class='nav-item'>
            <a class='nav-link' aria-current='page' href='/user-manual/index.html'>
              <i class='fa fa-home'></i>
              Home
            </a>
          </li>
          <li class='nav-item'>
            <a class='nav-link' href='/user-manual/sitemap.html'>
              <i class='fa fa-sign-out'></i>
              Sitemap
            </a>
          </li>
        </ul>
      </div>
    </div>
  </nav>
</div>
<div id="content">
<h1 class="title">CoupledCluster</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgee672d6">1. CoupledCluster algorithm</a>
<ul>
<li><a href="#orged8ee03">1.1. Input</a></li>
<li><a href="#org811b8a0">1.2. Output</a></li>
<li><a href="#org1f59886">1.3. Theory</a></li>
<li><a href="#org9f3c28a">1.4. Computational Complexity and memory footprint</a>
<ul>
<li><a href="#org61c4643">1.4.1. <code>method: type: Ccsd</code> algorithm</a></li>
<li><a href="#org6ce39e0">1.4.2. <code>method: type: Drccd</code> algorithm</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgee672d6" class="outline-2">
<h2 id="orgee672d6"><span class="section-number-2">1</span> <a href="#orgee672d6">CoupledCluster algorithm</a></h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orged8ee03" class="outline-3">
<h3 id="orged8ee03"><span class="section-number-3">1.1</span> <a href="#orged8ee03">Input</a></h3>
<div class="outline-text-3" id="text-1-1">
<p>
A typical input to call the CoupledCluster algorithm is given below.
</p>

<div class="org-src-container">
<pre class="src src-sh">- name: CoupledCluster
  <span style="color: #a626a4;">in</span>:
    method:
      <span style="color: #e44649;">type</span>: Ccsd
    slicedEigenEnergies: EigenEnergies
    coulombIntegrals: CoulombIntegrals
    slicedCoulombVertex: CoulombVertex
    integralsSliceSize: 100
    maxIterations: 20
    energyConvergence: 1.0E-4
    amplitudesConvergence: 1.0E-4
    mixer:
      <span style="color: #e44649;">type</span>: DiisMixer
      maxResidua: 5
  out:
    energy: CcsdEnergy
    amplitudes: Amplitudes
</pre>
</div>

<p>
<code>method: type:</code> specifies the  coupled-cluster approximation for the amplitudes to be used.
The <code>Ccsd</code> or <code>Drccd</code> approximation are currently avaible. 
</p>

<p>
<code>slicedEigenEnergies</code>, <code>coulombIntegrals</code> and <code>slicedCoulombVertex</code> require input tensors
corresponding to one-electron Hartree&#x2013;Fock energies \(\epsilon_p\), two-electron
integrals \(V_{pq}^{rs}\) and the CoulombVertex \(\Gamma_{pG}^r\), respectively.
The latter is used to compute two-electron integrals \(V_{cd}^{ab}\) on-the-fly.
<code>CoulombIntegrals</code> is an output generated by the <code>VertexCoulombIntegrals</code> algorithm. TODO:add links to algorithms.
<code>EigenEnergies</code> is an output generated by the <code>DefineHolesAndParticles</code> algorithm.
<code>CoulombVertex</code> is an output generated by the <code>SliceOperator</code> algorithm.
</p>

<p>
<code>integralsSliceSize</code> controls the slice-size of the \(V_{cd}^{ab}\) integrals, which are computed on-the-fly to
reduce the memory footprint. The integer value specified for <code>integralsSliceSize</code>  refers to the dimension size
used for the \(a\) and \(b\) index. We recommend setting <code>integralsSliceSize: 100</code> to balance
computational efficency with memory usage. Smaller/larger values reduce/increase the memory footprint.
</p>

<p>
<code>maxIterations</code> controls the maximum number of iterations allowed to solve the  \(t_{ij}^{ab}\) and \(t_i^a\) amplitude equations.
If convergence of the energy and residual vectors within the specified thresholds is achieved using fewer iterations
than <code>maxIterations</code>, the algorithm will stop.
If <code>maxIterations</code> is reached without achieving <code>energyConvergence</code> and <code>amplitudesConvergence</code> , the algorithm was not
successful and will stop. We recommend to set <code>maxIterations: 20</code>, which is ususally enough to achieve reasonable convergence
thresholds.
</p>

<p>
<code>energyConvergence</code> specifies the convergence threshold for the correlation energy.
<code>amplitudesConvergence</code> specifies the convergence threshold for the residual vector of the singles and doubles amplitude equations.
If <code>energyConvergence</code> and <code>amplitudesConvergence</code> is achieved, the iterative solution was successful and the algorithm will stop.
</p>

<p>
<code>mixer:</code> specifies mixer-specific parameters used to solve the amplitude equations iteratively.
The direct inversion iterative subspace (Diis) algorithm is the default algorithm used to mix amplitude guesses from previous
iterations to improve the guess for the next iteration.
<code>mixer: type:</code> can currently be set to <code>DiisMixer</code> or <code>LinearMixer</code>.
</p>

<p>
For <code>mixer: type: DissMixer</code>, it is possible to specify <code>mixer: maxResidua:</code>, which controls the number of residual
vectors used by the Diis algorithm.
We recommend to set the maximum number of residual vectors used in the <code>DiisMixer</code> to <code>5</code>.
More residual vectors result in a larger memory footprint.
</p>

<p>
For <code>mixer: type: LinearMixer</code> it is possible to specify <code>mixer: ratio:</code>, which controls the mixing ratio used
to update the new guess of the amplitudes based on estimates from the previous and current iteration.
The <code>LinearMixer</code> exhibits the smallest possible memory footprint from all currently available mixers,
keeping two sets of amplitudes in memory at once only.
We recommend to set <code>mixer: ratio: 1.0</code>. Smaller ratios result in a slower but perhaps more stable convergence.
</p>
</div>
</div>

<div id="outline-container-org811b8a0" class="outline-3">
<h3 id="org811b8a0"><span class="section-number-3">1.2</span> <a href="#org811b8a0">Output</a></h3>
<div class="outline-text-3" id="text-1-2">
<p>
The output of the CoupledCluster algorithm includes <code>energy:</code> and <code>amplitudes:</code> . The <code>amplitudes</code> output contains
the converged singles and doubles amplitude tensors. The amplitudes can be used as input for algorithms
that estimate the finite simulation cell size error (<code>TransitionStructureFactorFiniteSizeCorrection</code>)
and the basis set incompleteness errors (<code>CcsdFocalPointBasisSetCorrection</code>).
</p>
</div>
</div>

<div id="outline-container-org1f59886" class="outline-3">
<h3 id="org1f59886"><span class="section-number-3">1.3</span> <a href="#org1f59886">Theory</a></h3>
<div class="outline-text-3" id="text-1-3">
<p>
This algorithm solves the coupled-cluster amplitude equations.
TODO: add short description and refs
</p>
</div>
</div>

<div id="outline-container-org9f3c28a" class="outline-3">
<h3 id="org9f3c28a"><span class="section-number-3">1.4</span> <a href="#org9f3c28a">Computational Complexity and memory footprint</a></h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org61c4643" class="outline-4">
<h4 id="org61c4643"><span class="section-number-4">1.4.1</span> <a href="#org61c4643"><code>method: type: Ccsd</code> algorithm</a></h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
The computational bottle neck of the <code>Ccsd</code> algorithm originates in most calculations from the following expression, which is
part of the doubles amplitude equations: \(V_{cd}^{ab} t_{ij}^{cd}\). The computational cost of evaluating this expression scales
as \(\mathcal{O}(N_{\rm o}^2 N_{\rm v}^4)\). To avoid a memory footprint of \(\mathcal{O}(N_{\rm v}^4)\) from storing
\(V_{cd}^{ab}\), only slices of \(V_{cd}^{xy}\) are computed on-the-fly and used in the contraction, reducing
the corresponding memory footprint to \(\mathcal{O}(N_{\rm v}^2 N_{\rm s}^2)\), where \(N_{\rm s}\) is controlled using 
the <code>integralsSliceSize</code> keyword.
</p>
</div>
</div>

<div id="outline-container-org6ce39e0" class="outline-4">
<h4 id="org6ce39e0"><span class="section-number-4">1.4.2</span> <a href="#org6ce39e0"><code>method: type: Drccd</code> algorithm</a></h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
TODO: add short info about Drccd
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-12-17 Fri 20:13</p>
</div>
</body>
</html>
